In [1]:
import pandas as pd
import numpy as np

In [2]:
arr=np.random.randint(1,100,(3,3))

df = pd.DataFrame(arr, columns=["A","B","C"], index = ["X","y","z"])

df.head()
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, X to z
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      int64
 1   B       3 non-null      int64
 2   C       3 non-null      int64
dtypes: int64(3)
memory usage: 96.0+ bytes

In [3]:
df.describe()

               A          B          C
count   3.000000   3.000000   3.000000
mean   55.000000  69.666667  39.666667
std    33.778692  16.802778   8.962886
min    16.000000  55.000000  34.000000
25%    45.000000  60.500000  34.500000
50%    74.000000  66.000000  35.000000
75%    74.500000  77.000000  42.500000
max    75.000000  88.000000  50.000000

In [4]:
df

    A   B   C
X  16  66  50
y  74  88  34
z  75  55  35

In [5]:
df.nunique()

A    3
B    3
C    3
dtype: int64

In [6]:
df['A'].unique()

array([16, 74, 75])

In [7]:
df.shape

(3, 3)

In [8]:
df1=pd.read_csv('./Data/concrete.csv')

df1.head()

   cement   slag  ash  water  superplastic  coarseagg  fineagg  age  strength
0   540.0    0.0  0.0  162.0           2.5     1040.0    676.0   28     79.99
1   540.0    0.0  0.0  162.0           2.5     1055.0    676.0   28     61.89
2   332.5  142.5  0.0  228.0           0.0      932.0    594.0  270     40.27
3   332.5  142.5  0.0  228.0           0.0      932.0    594.0  365     41.05
4   198.6  132.4  0.0  192.0           0.0      978.4    825.5  360     44.30

In [9]:
df1.sample(10)

,cement,slag,ash,water,superplastic,coarseagg,fineagg,age,strength
617,254.0,0.0,0.0,198.0,0.0,968.0,863.0,3,9.31
155,362.6,189.0,0.0,164.9,11.6,944.7,755.8,56,77.30
658,305.3,203.5,0.0,203.5,0.0,965.4,631.0,7,25.89
8,266.0,114.0,0.0,228.0,0.0,932.0,670.0,28,45.85
329,246.8,0.0,125.1,143.3,12.0,1086.8,800.9,3,23.52
908,313.0,145.0,0.0,127.0,8.0,1000.0,822.0,28,44.52
898,336.0,0.0,0.0,182.0,3.0,986.0,817.0,28,44.86
351,213.5,0.0,174.2,154.6,11.7,1052.3,775.5,28,45.94
542,255.0,0.0,0.0,192.0,0.0,889.8,945.0,90,21.86
778,295.0,0.0,0.0,185.0,0.0,1069.0,769.0,7,14.80

In [10]:
#df1.index = df1["slag"]

coffee=pd.read_csv('https://raw.githubusercontent.com/KeithGalli/complete-pandas-tutorial/master/warmup-data/coffee.csv')

coffee.head

<bound method NDFrame.head of           Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35>

In [11]:
coffee.loc[1,"Units Sold"] = 10

coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          10
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [12]:
coffee.Day
print("\n\n")

coffee.Day

0        Monday
1        Monday
2       Tuesday
3       Tuesday
4     Wednesday
5     Wednesday
6      Thursday
7      Thursday
8        Friday
9        Friday
10     Saturday
11     Saturday
12       Sunday
13       Sunday
Name: Day, dtype: object

In [13]:
coffee[coffee["Units Sold"] > 30]["Day"]

4     Wednesday
6      Thursday
8        Friday
9        Friday
10     Saturday
11     Saturday
12       Sunday
13       Sunday
Name: Day, dtype: object

In [14]:
coffee

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          10
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [15]:
coffee[coffee["Coffee Type"].str.contains("Es")]

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
2     Tuesday    Espresso          30
4   Wednesday    Espresso          35
6    Thursday    Espresso          40
8      Friday    Espresso          45
10   Saturday    Espresso          45
12     Sunday    Espresso          45

In [16]:
olym_results = pd.read_csv('results.csv')

olym_results.head()

,year,type,discipline,event,as,athlete_id,noc,team,place,tied,medal
0,1912.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,NaN,17.0,True,NaN
1,1912.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jean Montariol,NaN,False,NaN
2,1920.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,NaN,32.0,True,NaN
3,1920.0,Summer,Tennis,"Doubles, Mixed (Olympic)",Jean-François Blanchy,1,FRA,Jeanne Vaussard,8.0,True,NaN
4,1920.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jacques Brugnon,4.0,False,NaN

In [17]:
ind_oly_results_90= olym_results[(olym_results['noc'] == 'IND') & (olym_results['medal'].notna()) & (olym_results['year'] > 1990)]

print(ind_oly_results_90)

          year    type     discipline  \
815     1996.0  Summer         Tennis
198645  2008.0  Summer       Shooting
202806  2000.0  Summer  Weightlifting
226718  2012.0  Summer       Shooting
226776  2004.0  Summer       Shooting
229566  2008.0  Summer         Boxing
233672  2008.0  Summer      Wrestling
233673  2012.0  Summer      Wrestling
233751  2012.0  Summer      Wrestling
243511  2012.0  Summer      Badminton
260121  2010.0  Summer         Boxing
260146  2020.0  Summer         Hockey
260281  2020.0  Summer         Hockey
260290  2020.0  Summer         Hockey
263286  2010.0  Summer         Boxing
263310  2012.0  Summer         Boxing
267158  2012.0  Summer       Shooting
279130  2016.0  Summer      Badminton
279131  2020.0  Summer      Badminton
279177  2020.0  Summer  Weightlifting
279179  2016.0  Summer      Wrestling
285340  2020.0  Summer         Hockey
285342  2020.0  Summer         Hockey
288801  2020.0  Summer         Hockey
301635  2020.0  Summer         Boxing
301669  2020.0  Summer      Athletics
301684  2020.0  Summer         Hockey
301685  2020.0  Summer         Hockey
301686  2020.0  Summer         Hockey
301687  2020.0  Summer         Hockey
301688  2020.0  Summer         Hockey
301689  2020.0  Summer         Hockey
301690  2020.0  Summer         Hockey
301691  2020.0  Summer         Hockey
301692  2020.0  Summer         Hockey
301707  2020.0  Summer      Wrestling
301709  2020.0  Summer      Wrestling
306403  2020.0  Summer         Hockey
306404  2020.0  Summer         Hockey

                                              event  \
815                          Singles, Men (Olympic)
198645          Air Rifle, 10 metres, Men (Olympic)
202806           Light-Heavyweight, Women (Olympic)
226718          Air Rifle, 10 metres, Men (Olympic)
226776                   Double Trap, Men (Olympic)
229566                  Middleweight, Men (Olympic)
233672       Welterweight, Freestyle, Men (Olympic)
233673       Welterweight, Freestyle, Men (Olympic)
233751        Lightweight, Freestyle, Men (Olympic)
243511                     Singles, Women (Olympic)
260121                      Lightweight, Boys (YOG)
260146                        Hockey, Men (Olympic)
260281                        Hockey, Men (Olympic)
260290                        Hockey, Men (Olympic)
263286                     Bantamweight, Boys (YOG)
263310                   Flyweight, Women (Olympic)
267158  Rapid-Fire Pistol, 25 metres, Men (Olympic)
279130                     Singles, Women (Olympic)
279131                     Singles, Women (Olympic)
279177                   Flyweight, Women (Olympic)
279179      Lightweight, Freestyle, Women (Olympic)
285340                        Hockey, Men (Olympic)
285342                        Hockey, Men (Olympic)
288801                        Hockey, Men (Olympic)
301635                Welterweight, Women (Olympic)
301669                 Javelin Throw, Men (Olympic)
301684                        Hockey, Men (Olympic)
301685                        Hockey, Men (Olympic)
301686                        Hockey, Men (Olympic)
301687                        Hockey, Men (Olympic)
301688                        Hockey, Men (Olympic)
301689                        Hockey, Men (Olympic)
301690                        Hockey, Men (Olympic)
301691                        Hockey, Men (Olympic)
301692                        Hockey, Men (Olympic)
301707       Welterweight, Freestyle, Men (Olympic)
301709      Featherweight, Freestyle, Men (Olympic)
306403                        Hockey, Men (Olympic)
306404                        Hockey, Men (Olympic)

                                 as  athlete_id  noc   team  place   tied  \
815                    Leander Paes         287  IND    NaN    3.0  False
198645               Abhinav Bindra       93075  IND    NaN    1.0  False
202806            Karnam Malleswari       94934  IND    NaN    3.0  False
226718                 Gagan Narang      104771  IND    NaN    3.0  False
226776         Rajyavardhan Rathore      104792  IND    NaN    2.0  False
229566               Vijender Singh      106269  IND    NaN    3.0   True
233672                 Sushil Kumar      108052  IND    NaN    3.0   True
233673                 Sushil Kumar      108052  IND    NaN    2.0  False
233751               Yogeshwar Dutt      108111  IND    NaN    3.0   True
243511                 Saina Nehwal      112486  IND    NaN    3.0  False
260121          Vikas Krishan Yadav      120754  IND    NaN    3.0  False
260146               Manpreet Singh      120770  IND  India    3.0  False
260281  Sreejesh Parattu Raveendran      120849  IND  India    3.0  False
260290               Birendra Lakra      120854  IND  India    3.0  False
263286                  Shiva Thapa      122482  IND    NaN    2.0  False
263310                     Mary Kom      122492  IND    NaN    3.0   True
267158                  Vijay Kumar      124813  IND    NaN    2.0  False
279130                 P. V. Sindhu      130550  IND    NaN    2.0  False
279131                 P. V. Sindhu      130550  IND    NaN    3.0  False
279177                Mirabai Chanu      130576  IND    NaN    2.0  False
279179                 Sakshi Malik      130579  IND    NaN    3.0   True
285340           Rupinder Pal Singh      134444  IND  India    3.0  False
285342               Surender Kumar      134445  IND  India    3.0  False
288801            Harmanpreet Singh      136645  IND  India    3.0  False
301635            Lovlina Borgohain      143726  IND    NaN    3.0   True
301669                Neeraj Chopra      143754  IND    NaN    1.0  False
301684                 Amit Rohidas      143769  IND  India    3.0  False
301685               Dilpreet Singh      143770  IND  India    3.0  False
301686                Gurjant Singh      143771  IND  India    3.0  False
301687                 Hardik Singh      143772  IND  India    3.0  False
301688               Lalit Upadhyay      143773  IND  India    3.0  False
301689                Mandeep Singh      143774  IND  India    3.0  False
301690             Nilakanta Sharma      143776  IND  India    3.0  False
301691               Shamsher Singh      143777  IND  India    3.0  False
301692                        Sumit      143778  IND  India    3.0  False
301707                Bajrang Punia      143790  IND    NaN    3.0   True
301709                   Ravi Kumar      143792  IND    NaN    2.0  False
306403             Simranjeet Singh      147765  IND  India    3.0  False
306404                  Varun Kumar      147766  IND  India    3.0  False

         medal
815     Bronze
198645    Gold
202806  Bronze
226718  Bronze
226776  Silver
229566  Bronze
233672  Bronze
233673  Silver
233751  Bronze
243511  Bronze
260121  Bronze
260146  Bronze
260281  Bronze
260290  Bronze
263286  Silver
263310  Bronze
267158  Silver
279130  Silver
279131  Bronze
279177  Silver
279179  Bronze
285340  Bronze
285342  Bronze
288801  Bronze
301635  Bronze
301669    Gold
301684  Bronze
301685  Bronze
301686  Bronze
301687  Bronze
301688  Bronze
301689  Bronze
301690  Bronze
301691  Bronze
301692  Bronze
301707  Bronze
301709  Silver
306403  Bronze
306404  Bronze

In [18]:
ind_oly_results_90[ind_oly_results_90['year'] < 2000].sort_values(by='discipline').head(40)

,year,type,discipline,event,as,athlete_id,noc,team,place,tied,medal
815,1996.0,Summer,Tennis,"Singles, Men (Olympic)",Leander Paes,287,IND,NaN,3.0,False,Bronze

In [20]:
ind_oly_results_90.query('noc == "IND" and medal.notna()').head()

,year,type,discipline,event,as,athlete_id,noc,team,place,tied,medal
815,1996.0,Summer,Tennis,"Singles, Men (Olympic)",Leander Paes,287,IND,NaN,3.0,False,Bronze
198645,2008.0,Summer,Shooting,"Air Rifle, 10 metres, Men (Olympic)",Abhinav Bindra,93075,IND,NaN,1.0,False,Gold
202806,2000.0,Summer,Weightlifting,"Light-Heavyweight, Women (Olympic)",Karnam Malleswari,94934,IND,NaN,3.0,False,Bronze
226718,2012.0,Summer,Shooting,"Air Rifle, 10 metres, Men (Olympic)",Gagan Narang,104771,IND,NaN,3.0,False,Bronze
226776,2004.0,Summer,Shooting,"Double Trap, Men (Olympic)",Rajyavardhan Rathore,104792,IND,NaN,2.0,False,Silver

In [59]:
coffee

In [61]:
coffee=pd.read_csv('https://raw.githubusercontent.com/KeithGalli/complete-pandas-tutorial/master/warmup-data/coffee.csv')

coffee

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35